{
    "competence1": {
      "questions": [
        "Qu'est-ce qu'une variable en programmation ?",
        "Nommez trois langages de programmation courants.",
        "Quelle est la différence entre un compilateur et un interpréteur ?",
        "Qu'est-ce qu'un IDE?",
        "Quelle est la première étape pour créer un programme informatique ?",
        "Citez un langage de programmation populaire pour les débutants.",
        "À quoi sert la commande print dans la plupart des langages de programmation ?",
        "Quelle est la différence entre un logiciel et une application ?",
        "Que signifie 'exécuter' un programme ?",
        "Quel outil utilise-t-on pour écrire du code informatique ?",
        "Citez un type de test qu'on peut réaliser pour vérifier qu'une application fonctionne bien.",
        "Qu'est-ce qu'une boucle en programmation ?",
        "Qu'est-ce qu'un bug en informatique ?",
        "Pourquoi est-il important de commenter son code ?"
      ]
    },
    "competence2": {
      "questions": [
        "Qu'est-ce que la complexité temporelle d'un algorithme ?",
        "Qu'est-ce que la complexité spatiale d'un algorithme ?",
        "Qu'est-ce qu'un algorithme ?",
        "Pourquoi est-il important qu'un programme soit rapide et efficace ?",
        "Comment un ordinateur mesure-t-il la vitesse d'un programme ?",
        "Qu'est-ce qu'un raccourci clavier et à quoi cela sert-il ?",
        "Que pourrait-on faire pour améliorer la vitesse d'un programme qui est lent ?",
        "Qu'est-ce que la répétition de code et pourquoi est-ce problématique ?",
        "Comment peut-on réduire la quantité de mémoire qu'un programme utilise ?",
        "Qu'est-ce qu'une mise à jour de logiciel ?",
        "Pourquoi est-il important de tester un programme avec des utilisateurs différents ?",
        "Qu'est-ce que le multitâche en informatique ?"
      ]
    },
    "competence3": {
      "questions": [
        "Qu'est-ce que l'adressage IP statique et dynamique ?",
        "Comment vérifie-t-on que l'ordinateur est bien connecté à Internet ?",
        "À quoi sert un mot de passe sur un ordinateur ?",
        "Que signifie 'installer un logiciel' ?",
        "Qu'est-ce qu'une mise à jour de système d'exploitation ?",
        "Citez un élément important à sécuriser sur un réseau informatique.",
        "Qu'est-ce qu'un antivirus ?",
        "Qu'est-ce que le Wi-Fi ?",
        "Comment peut-on partager un fichier entre deux ordinateurs ?",
        "À quoi sert un câble Ethernet ?",
        "Qu'est-ce qu'un nom d'utilisateur ?"
      ]
    },
    "competence4": {
      "questions": [
        "Qu'est-ce qu'une base de données ?",
        "Qu'est-ce qu'une donnée numérique ?",
        "À quoi sert une base de données pour un site web ?",
        "Citez un exemple d'information qu'on peut stocker dans une base de données.",
        "Qu'est-ce qu'un formulaire en ligne et comment cela peut-il servir à collecter des données ?",
        "Quelle est la différence entre enregistrer des données et les supprimer ?",
        "Comment une application peut-elle utiliser les données d'une base de données ?",
        "Qu'est-ce qu'un tableau dans une base de données ?",
        "Qu'est-ce que la saisie de données ?",
        "Pourquoi est-il important de faire des sauvegardes de données ?",
        "Qu'est-ce qu'une recherche de données ?"
      ]
    },
    "competence5": {
      "questions": [
        "Qu'est-ce qu'un diagramme de Gantt?",
        "Qu'est-ce qu'un projet en informatique ?",
        "Pourquoi a-t-on besoin de planifier un projet ?",
        "Qu'est-ce qu'un objectif dans un projet ?",
        "Comment fait-on pour savoir si un projet est réussi ?",
        "Pourquoi est-ce important de travailler en équipe sur un projet ?",
        "Qu'est-ce qu'une échéance ou un délai dans un projet ?",
        "Quel outil peut-on utiliser pour organiser les tâches d'un projet ?",
        "Qu'est-ce qu'un budget dans un projet informatique ?",
        "Qu'est-ce que le rôle d'un chef de projet ?",
        "Pourquoi doit-on parfois ajuster les plans d'un projet ?"
      ]
    },
    "competence6": {
      "questions": [
        "Qu'est-ce qu'un rôle de leader dans une équipe informatique ?",
        "Qu'est-ce que la collaboration en informatique ?",
        "Pourquoi est-ce important de bien communiquer dans une équipe ?",
        "Quel est l'avantage de travailler en équipe pour résoudre un problème informatique ?",
        "Qu'est-ce qu'une réunion d'équipe ?",
        "Comment peut-on s'assurer que tout le monde dans l'équipe est d'accord ?",
        "Quelle compétence est importante pour travailler avec les autres ?",
        "Qu'est-ce qu'un rôle dans une équipe et donnez un exemple ?",
        "Comment une équipe peut-elle prendre une décision ensemble ?",
        "Qu'est-ce que la responsabilité dans une équipe ?",
        "Comment fait-on pour partager son travail avec l'équipe ?"
      ]
    }
  }
  